app/Controllers/usuario_controller.php

public function formValidation() {

        $input=  $this->validate([
                'nombre' => 'required|min_length[3]',
                'apellido' => 'required|min_length[3]|max_length[25]',
                'usuario' => 'required|min_length[3]',
                'email' => 'required|min_length[4]|max_length[100]|valid_email|is_unique[ usuarios.email]',
                'pass'=> 'required|min_length[3]|max_length[10]'
        ],
        );
        $formModel = new usuarios_Model();

        if (!$input) {
                $data['titulo']='Registro';
                echo view('front/head_view', $data);
                echo view('front/nav_view');
                echo view('Back/usuario/registro', ['validation' => $this->validator]);
                echo view('front/footer_view');
        } else {

                $formModel->save([
                        'nombre' => $this->request->getVar('nombre'),
                        'apellido' => $this->request->getVar('apellido'),
                        'usuario' => $this->request->getVar('usuario'),
                        'email' => $this->request->getVar('email'),
                        'pass' => password_hash ($this->request->getVar('pass'), PASSWORD_DEFAULT)
                        //password_hash() crea un nuevo hash de contraseña usando un algoritmo de hash de único sentido.
                ]);
---
INSERT INTO `usuarios` (`nombre`, `apellido`, `usuario`, `email`, `pass`) VALUES ('Roberto', 'Arias', 'rober', 'roberto@gmail.com', '$2y$10$u2pgS3r/deP9fJ3mb.yK.OAh.Fkb.ObF23Ez8SqquYxdHjoxhnbpO')